{
  "menuButton": "मेन्यू",
  "resultTab": "परिणाम",
  "terminalTab": "टर्मिनल",
  "createFile": "फ़ाइल बनाएँ",
  "openFile": "खुली फाइल",
  "openProject": "ओपन प्रोजेक्ट",
  "runFile": "इस फ़ाइल को चलाएँ",
  "saveFile": "इस फाइल को सेव करें",
  "unnamedFile": "अनाम फ़ाइल",
  "settings": "समायोजन",
  "documentation" : "प्रलेखन",
  "language": "भाषा",
  "location": "स्थान (शहर)",
  "done": "पूर्ण",
  "error": "गलती",
  "cannotRun": "यह फ़ाइल नहीं चला सकता",
  "noFileOpened": "कोई फ़ाइल नहीं खोली गई",
  "enterName": "कृपया एक फ़ाइल नाम दर्ज करें",
  "fileName": "फ़ाइल का नाम",
  "docContent": "--- प्रीमियर गाऊ प्रलेखन ---\n\n--विंडो विवरण --\n- मुख्य टैब : यह आईडीई है, जिसमें सभी कोड फ़ाइल शामिल हैं\n- ऊपरी टैब: परिणाम और टर्मिनल शामिल हैं\n- दायां टैब: जब आप कोई प्रोजेक्ट खोलते हैं तो ट्री व्यू होता है\n\n-- मुख्य टैब विवरण --\n- बॉटम्स टैब : पहले से खोली गई फाइलों को चुनने के लिए उस पर क्लिक करें\n- केंद्र टैब : यह वह क्षेत्र है जहां आप अपनी फ़ाइल को स्वत: पूर्णता और वाक्यविन्यास रंग के साथ संपादित कर सकते हैं\n\n-- ट्री व्यू विवरण --\n- फ़ाइल/निर्देशिका का नाम: आपको एक पदानुक्रम के साथ एक फ़ाइल/निर्देशिका ट्री दिखाई देगी, जिस पर आप क्लिक करके प्रोजेक्ट की कोई भी फ़ाइल खोल सकते हैं\n- फ़ाइल बनाएँ (राइट क्लिक): प्रोजेक्ट की निर्दिष्ट निर्देशिका में एक फ़ाइल बनाएँ\n- फ़ाइल का नाम बदलें (राइट क्लिक करें): चयनित फ़ाइल का नाम बदलें\n- फ़ाइल हटाएं (राइट क्लिक करें): चयनित फ़ाइल हटाएं\n\n--बटन विवरण --\n- मेनू : मेनू विवरण खोलें\n- परिणाम: प्रोलॉग फ़ाइल के संकलन का परिणाम दिखाएं\n- टर्मिनल : एक टर्मिनल खोलें\n\n-- मेनू विवरण --\n- फ़ाइल बनाएँ: बिना नाम के और बिना सहेजे फ़ाइल बनाता है\n- फ़ाइल खोलें: संपादक टैब में एक फ़ाइल खोलें\n- ओपन प्रोजेक्ट: एक प्रोजेक्ट के रूप में एक निर्देशिका और सभी उप-निर्देशिका खोलें (केवल एक्सएमएल, पीएल, एमडी फाइलें)\n- इस फ़ाइल को चलाएँ: फ़ाइल को वर्तमान टैब में चलाएँ और परिणाम टैब में परिणाम दिखाएँ\n- इस फाइल को सेव करें: फाइल को सेव करें, अगर फाइल को पता है तो आप एक नाम चुन सकते हैं\n- सेटिंग्स: सेटिंग्स विंडो खोलें\n\n-- सेटिंग्स विवरण --\n- भाषा: आप आईडीई की भाषा बदलते हैं\n- स्थान (शहर): आप एक शहर का चयन कर सकते हैं। निर्दिष्ट स्थान मौसम के कार्य में आईडीई रंग बदल जाएगा\n- हो गया: सेटिंग्स से बाहर निकलें और सहेजें"
}